# CoverOffsetTooLongTemp Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..CoverOffsetTooLongTemp Property
BuiltInFailures..::..FabricFailures Class See Also
---
Cover offset is greater than host thickness - support for transient Single Fabric Sheet in editor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CoverOffsetTooLongTemp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CoverOffsetTooLongTemp As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CoverOffsetTooLongTemp {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace